# Taps
tap "amiaopensource/amiaos"
tap "anomalyco/tap"
tap "homebrew-ffmpeg/ffmpeg"
tap "lescanauxdiscrets/tap"  # provides zvbi for ffmpeg

# --- Core CLI Tools ---
brew "bat"              # cat replacement with syntax highlighting
brew "delta"            # git diff viewer with syntax highlighting
brew "fd"               # find replacement, fast and user-friendly
brew "fzf"              # fuzzy finder for files, history, etc.
brew "gh"               # GitHub CLI
brew "git"              # version control
brew "htop"             # interactive process viewer
brew "prettyping"       # prettier ping output
brew "ripgrep"          # grep replacement, very fast
brew "tmux"             # terminal multiplexer
brew "zoxide"           # smart cd replacement (z/zi)

# --- Development ---
brew "gcc"              # GNU compiler collection
brew "openssl@3"        # TLS/SSL toolkit
brew "opencode"         # AI coding assistant

# --- Media ---
brew "homebrew-ffmpeg/ffmpeg/ffmpeg"  # full ffmpeg (tap version, skip chromaprint to avoid circular dep)
brew "tesseract"        # OCR engine
brew "whisper-cpp"      # speech-to-text

# --- Other Tools ---
brew "mint"             # Swift package manager
brew "rclone"           # cloud storage sync

# --- Casks (macOS Applications) ---
cask "1password"              # password manager
cask "chatgpt"                # OpenAI chat client
cask "claude"                 # Anthropic chat client
cask "conductor"              # web server manager
cask "cursor"                 # AI-powered code editor
cask "discord"                # chat and communities
cask "figma"                  # design tool
cask "fork"                   # git GUI client
cask "ghostty"                # terminal emulator
cask "github"                 # GitHub Desktop
cask "google-chrome"          # web browser
cask "handy"                  # speech-to-text (handy.computer)
cask "lm-studio"              # local LLM runner
cask "obsidian"               # markdown knowledge base
cask "ollama-app"             # local LLM server (menu bar)
cask "opencode-desktop"       # AI coding assistant
cask "orbstack"               # Docker and Linux VMs
cask "plex"                   # media server client
cask "postman"                # API testing
cask "private-internet-access" # VPN
cask "raycast"                # launcher and productivity
cask "tailscale-app"          # mesh VPN
cask "transmit"               # file transfer (FTP/SFTP/S3)
cask "whatsapp"               # messaging
cask "windows-app"            # remote desktop (formerly Microsoft Remote Desktop)
