# Taps
tap "amiaopensource/amiaos"          # provides amia for ffmpeg
tap "anomalyco/tap"                  # provides opencode tap
tap "homebrew-ffmpeg/ffmpeg"         # provides ffmpeg tap
tap "lescanauxdiscrets/tap"          # provides zvbi for ffmpeg

# --- Core CLI Tools ---
brew "atuin"                         # shell history with sqlite backend (replaces ctrl+r)
brew "bat"                           # cat replacement with syntax highlighting
brew "git-filter-repo"               # rewrite git history (filter-branch alternative)
brew "delta"                         # git diff viewer with syntax highlighting
brew "eza"                            # ls replacement with icons and git support
brew "fd"                            # find replacement, fast and user-friendly
brew "fzf"                           # fuzzy finder for files, history, etc.
brew "gh"                            # GitHub CLI
brew "git"                           # version control
brew "htop"                          # interactive process viewer
brew "prettyping"                    # prettier ping output
brew "ripgrep"                       # grep replacement, very fast
brew "tmux"                          # terminal multiplexer
brew "zoxide"                        # smart cd replacement (z/zi)

# --- Development ---
brew "biome"                         # JavaScript/TypeScript formatter and linter
brew "flyctl"                        # fly.io CLI for deploying apps
brew "gcc"                           # GNU compiler collection
brew "openssl@3"                     # TLS/SSL toolkit
brew "anomalyco/tap/opencode"         # AI coding assistant (tap version, stays current)

# --- Media ---
brew "homebrew-ffmpeg/ffmpeg/ffmpeg" # full ffmpeg (tap version, skip chromaprint to avoid circular dep)
brew "tesseract"                     # OCR engine
brew "whisper-cpp"                   # speech-to-text

# --- Other Tools ---
brew "mas"                           # Mac App Store CLI
brew "mint"                          # Swift package manager
brew "unar"                          # universal archive extractor (rar, 7z, zip, etc.)

# --- Casks (macOS Applications) ---
cask "1password"                     # password manager
cask "caffeine"                      # prevent mac from sleeping
cask "figma"                         # design tool
cask "ghostty"                       # terminal emulator
cask "github"                        # GitHub Desktop
cask "google-chrome"                 # web browser
cask "handy"                         # speech-to-text (handy.computer)
cask "obsidian"                      # markdown knowledge base
cask "opencode-desktop"              # AI coding assistant
cask "postman"                       # API testing
cask "raycast"                       # launcher and productivity
cask "zed"                           # fast editor with native AI agent panel

